tap "goldeneggg/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "rcmdnk/file"
tap "universal-ctags/universal-ctags"
tap "versent/taps"
brew "anyenv"
brew "coreutils"
brew "readline"
brew "asdf"
brew "avrdude"
brew "awscli"
brew "python@3.8"
brew "azure-cli"
brew "bat"
brew "clang-format"
brew "convmv"
brew "curl"
brew "dep"
brew "dfu-programmer"
brew "dfu-util"
brew "direnv"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghq"
brew "git"
brew "git-secrets"
brew "gnupg"
brew "graphviz"
brew "grep"
brew "helm"
brew "helmfile"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli", link: false
brew "lftp"
brew "libmagic"
brew "mecab"
brew "minikube", link: false
brew "mycli"
brew "mysql@5.7"
brew "neovim"
brew "node"
brew "opencv@2"
brew "plantuml"
brew "postgresql@11"
brew "protobuf"
brew "rename"
brew "ripgrep"
brew "rmtrash"
brew "ruby-build"
brew "sops"
brew "tfenv"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "vim"
brew "wget"
brew "goldeneggg/tap/lsec2"
brew "osx-cross/arm/arm-gcc-bin"
brew "osx-cross/avr/avr-gcc@8", link: true
brew "rcmdnk/file/brew-file"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "versent/taps/saml2aws"
cask "adoptopenjdk"
cask "font-hack-nerd-font"
cask "minikube"
cask "shiftit"
cask "sketch"
