tap "goldeneggg/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "rcmdnk/file"
tap "universal-ctags/universal-ctags"
cask "adoptopenjdk"
brew "anyenv"
brew "readline"
brew "python"
brew "awscli"
brew "dep"
brew "direnv"
brew "fish"
brew "fzf"
brew "ghq"
brew "git"
brew "git-secrets"
brew "graphviz"
brew "grep"
brew "helmfile"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli", link: false
brew "libmagic"
brew "mecab"
brew "mysql@5.7"
brew "neovim"
brew "node"
brew "plantuml"
brew "protobuf"
brew "ripgrep"
brew "rmtrash"
brew "ruby-build"
brew "sops"
brew "tfenv"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "goldeneggg/tap/lsec2"
brew "rcmdnk/file/brew-file"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "minikube"
